package org.example;

import org.apache.poi.ss.usermodel.Sheet;

import java.util.List;
public class Main {

    public static void main(String[] args) {

//        Question q1 = new Question("איזו מבין הטענות הבאות אינה נכונה? ", "אליס בנתה אתר בית שרץ על foo.com בכתובת: foo.com/alice ונתנה גישה לאתר הבית שלה לכל חבריה. לבוב, שאינו חבר של אליס, יש אתר בית משלו על com.foo בכתובת: foo.com/bob. בוב החליט שכאשר ויקי, אחת מחברותיה של אליס, תגלוש לאתר הבית שלו, הוא ישים באתר הבית שלו iframe עם כתובת האתר של אליס ויקרא ממנו את התוכן של אתר הבית של אליס באמצעות javascript. כאשר בוב ינסה זאת, הוא יגלה, לצערו, שמנגנון ה same origin policy ימנע מהסקריפט שלו גישה למידע החוזר מאתר הבית של אליס. ", "אתר מסויים השתמש בחיטוי קלט כדי למנוע התקפות SQL injections. האתר הסיר את התווים: '=- (כל אחד בנפרד) מהקלטים של המשתמשים. למרבה הצער, הם שכחו את התו ; וזה מה שגרם להתקפת sql injection כנגד האתר. זאת דוגמא קלאסית לחסרון של שיטת blacklisting", "בהתקפות stored XSS ו reflected XSS, הקוד הזדוני מוחזר כחלק מהתשובה של השרת ", "ניצול חולשת SQL INJECTION כדי לבצע התקפת XSS הינו תרחיש הגיוני. ");
//        Question q2 = new Question("איזו מבין הטענות הבאות נכונה? ", " miner שמתחזק את כל הבלוקצ'יין באופן שוטף, יכול לעקוב אחר טרנזקציות ולדעת כמה ביטקוין יש לכתובת ביטקוין מסויימת ברגע נתון", " כדי לבזבז ביטקוין אין צורך במפתח הפרטי של הארנק הרלוונטי  ", " ב payments micro, אליס חייבת לסמוך על בוב (ספק השירות) שישחרר לה את הכסף המגיע לה ", " ביצוע שינויים במטבע הביטקוין מחייב אישור של סטושי");
//        Question q3 = new Question(" איזו מבין הטענות הבאות נכונה? ", "הכח של ההמונים, למשל באמצעות botnet, הוא הכח המניע מאחורי התקפת DDoS ", "התקפת קמינסקי היא בראש ובראשונה התקפת DoS ", "התקפות DoS נעשות אך ורק בשכבה הפיזית, הלינק, התעבורה, והרשת ", "ראשי התיבות DoS הן של התקפות Stack on Disk");
//        Question q4 = new Question("היכן ביטקוין משתמש ב nonce? ", "בתהליך החיפוש אחר בלוק חדש (הבלוק הבא שיצטרף לבלוקצ'יין) ", " ב hard form", "ב soft fork ", " כאשר miner מצטרף אל הרשת ");
//        Question q5 = new Question("איזו מבין הטענות הבאות אינה נכונה? ", "הגדרה נכונה של IDS מונעת התקפות poisoning DNS ", " תוקף בעל יכולות MitM בין קורבן לשרת ה DNS שאליו פנה אינו צריך לנחש את ה Id transaction כדי להצליח בהתקפת poisoning DNS ", "פרדוקס יום ההולדת אינו עקרון ייעודי עבור התקפת הרעלת ה DNS של קמינסקי, והוא עקרון שעומד בפני עצמו ושימושי גם לדברים אחרים. ", "תוקף בעל יכולות eavesdropping בין קורבן לשרת ה DNS שאליו פנה לא תמיד יצליח בהתקפת DNS poisoning ");
//        Question q6 = new Question("איזו מבין הטענות הבאות אינה נכונה? ", " בעיה גדולה ב One Time Pad היא העברת המפתחות", "בעיה גדולה בPublic Key Cryptography היא העברת המפתחות  ", "בעיה גדולה בRSA היא העברת המפתחות", "בעיה גדולה ב-DIFFIE HELLMAN היא העברת המפתחות");
//        Question q7 = new Question("תוקף הצליח לגנוב קובץ שמכיל סיסמאות לאימות של משתמשים. מטעמי אבטחה, כל הסיסמאות בו לא נשמרו כמות שהן, אלא הוחלפו בhash  שלהן. איזה מבין ההתקפות הבאות ינסה התוקף לבצע כדי להשיג את הסיסמאות המקוריות דרך הקובץ הנל?", " התקפת brute force", " התקפת spoofing", "התקפת SQL Injection", "התקפת CSRF");
//        Question q8 = new Question("איזו מבין הטענות הבאות נכונה? ", "בקריפטוגרפיה, MAC המיושם נכון מספק אמינות המידע  ", " בקריפטוגרפיה, מטרת השימוש בCBC  בצופן בלוקים היא לספק אמינות המידע", " בקריפטוגרפיה, CA חותם על המפתחות שה CA יצר עבור שרת האינטרנט שפנה אל ה CA", "בקריפטוגרפיה, PKI  נועד לוודא שימוש מאובטח ב ARP");
//        Question q9 = new Question("איזו מבין הטענות הבאות אינה נכונה? ", "הגדרה נכונה של IDS  מונעת התקפות DNS poisoning", "מאפשרת להגיב להתקפות שזוהו IPS הגדרה נכונה של", "הגדרה של מחשב עם מיפוי סטטי בין כתובות IP וכתובות MAC יכולה לסייע כנגדת התקפםות ARP SPOOFING/POISONING", " שימוש בnmap יכול לסייע לזהות חולשות");
//        Question q10 = new Question("מניעת התקפת SQL injection , לא תתבצע על ידי: ", "IDS", "חיטוי הקלט בצד השרת", "סינון קלט המשמש לביצוע שאילתת הSQL ", "חומת אש אפליקטיבית");
//        Question q11 = new Question("איזו מבין הטענות הבאות נכונה? ", "ב-micro payments, אליס יודעת שבוב ישחרר לה את הכסף שמגיע לה (אחרת הוא יפסיד כסף) ", " ב-escrow transactions, המתווך חייב לאשר את העסקה כדי שהיא תהיה חוקית ", "בביטקוין, להשתתף בתהליך כריית ביטקוין אם רוצים לבצע עסקאות בביטקוין", "בביטקוין, משתמשים בOne Time Pad בכדי לייצר את הארנקים");
//        Question q12 = new Question("איזו מבין הטענות הבאות אינה נכונה? ", "ביצוע התקפת הרעלת DNS מחייבת יכולות MitM   ", "ביצוע התקפת הרעלת ARP אפשרית עם יכולות Off path   ", "ביצוע התקפת DDoS יכולה להתבצע בעזרת Mirai   ", "הצלחה בביצוע התקפת Syn flood קשה יותר אם משתמשים ב-Syn cookies ");
//        Question q14 = new Question("איזו מבין הטענות הבאות אינה נכונה?", "בהתקפת stored xss העובדה שהדפדפן מצרף cookies לבקשות מהותית ", ".בהתקפת csrf השרת אינו יודע שהבקשה אינה באמת של הקורבן", ".x-frame-options אינו מיועד להגנה מפני sql injection", "אחת מהדרכים להגן מפני התקפת csrf היא בעזרת CSRF TOKEN");
//        Question q13 = new Question("איזו מבין הטענות הבאות אינה נכונה?", " OCSP stapling הינו יעיל בזכות השימוש בעץ מרקל.", " OCSP stapling הינו מנגנון שונה לחלוטין מOCSP רגיל.", "ניתן לתמוך בOCSP  וגם בCRL ולא חייבים לבחור רק אחד מהם", "השימוש בCRL תורם לבטיחות של .PKI");
//        Question q15 = new Question("איזו מבין הטענות הבאות נכונה? ", "משתמשים בTLS, משתמשים בchain of trust ", "לקוח הגולש לשרת foo.com מוודא את תקינות התעודה על ידי וידוא שהתעודה נחתמה באופן קריפטוגרפי על ידי foo.com", "שרת אינטרנט מייצר ניגש לRoot CA  ומבקש ממנו לחתום על המפתח הפומבי של שרת האינטרנט", "שרת Root CA חותם ישירות על המפתח הפומבי של שרת האינטרנט");
//        Question q16 = new Question("איזו מבין הטענות הבאות נכונה? ", " ב-CT,  המוניטורים מנטרים את הלוגרים, והלוגרים מתחזקים לוג של תעודות שהונפקו על ידי CA-ים", "ב-CT, המוניטורים מנטרים את ה-CA ים , והלוגרים את המוניטורים", "ב-CT המוניטורים מנטרים את הלוגרים, והלוגרים את המוניטורים", "ב-CT, הלוגרים מתחזקים לוג של תעודות שהונפקו על ידי CA-ים, והמוניטורים מנטרים את ה-CA-ים");

        String EXCEL_PATH = "C:\\Users\\Yuval\\Desktop\\BDIKAEXCEL.xlsx";
        int NUM_OF_QUESTIONS = 16;

        ExcelReader er = new ExcelReader(EXCEL_PATH);
        Sheet sheet = er.getSheet();
        List<Question> questionList = er.getAllQustionsList(NUM_OF_QUESTIONS);

        QuestionsMixer qm = new QuestionsMixer();
        for(Question q: questionList){
            qm.addQuestion(q);
        }
        qm.printQuestions();
        qm.printAnswers();
        qm.createTxtFile();


    }
}

